{
  "meta": {
    "description": "Starship Drive Technology - Optimized for Gameplay",
    "design_note": "Constant visual velocity probes. No relativistic complexity.",
    "gameplay_targets": {
      "tier_1_galaxy_crossing": "10 minutes real time at 1x speed",
      "tier_10_galaxy_crossing": "30 seconds real time at 1x speed",
      "scaling": "20x speedup across 10 tiers (exponential ~1.4x per tier)"
    },
    "time_reference": {
      "1x_speed": "1 week game time per 1 second real time",
      "galaxy_diameter_ly": 100000
    }
  },
  "drives": [
    {
      "tier": 1,
      "id": "orion_pusher",
      "name": "Thermonuclear Pusher Plate",
      "short_name": "Nuclear Pulse",
      "effective_velocity_ly_per_year": 8700,
      "compute_cost": 0,
      "unlocked": true,
      "description": "Project Orion-derived thermonuclear pulse propulsion system.",
      "long_description": "The Thermonuclear Pusher Plate drive represents the logical evolution of Project Orion, the audacious 1958-1965 DARPA program led by Freeman Dyson and Ted Taylor at General Atomics. Where the original Orion used fission bombs, this system employs precisely-timed thermonuclear detonations for dramatically improved performance.\n\nThe spacecraft ejects small fusion pulse units behind a massive ablative pusher plate constructed from high-grade steel alloy with a tungsten coating. Each 0.1-kiloton fusion device detonates at a precisely calculated standoff distance, generating a plasma wavefront that strikes the pusher plate. Giant pneumatic shock absorbers—some over 30 meters in length—connect the plate to the payload section, smoothing the rapid-fire impulses into continuous acceleration.\n\nHistorically, Project Orion was cancelled following the 1963 Partial Nuclear Test Ban Treaty. However, the physics remains sound, and the concept represents one of the few propulsion systems achievable with known physics capable of practical interstellar travel.",
      "physics": {
        "principle": "Nuclear pulse propulsion via sequential thermonuclear detonations",
        "energy_source": "Deuterium-tritium fusion (17.6 MeV per reaction)",
        "thrust_mechanism": "Plasma momentum transfer to ablative pusher plate"
      },
      "references": [
        "Dyson, F. (1968). 'Interstellar Transport'. Physics Today.",
        "Taylor, T. (1965). 'Project Orion Final Report'. General Atomics GA-5009."
      ]
    },
    {
      "tier": 2,
      "id": "bussard_ramjet",
      "name": "Bussard Ramjet",
      "short_name": "Ramjet",
      "effective_velocity_ly_per_year": 12100,
      "compute_cost": 1e15,
      "unlocked": false,
      "description": "Interstellar ramjet collecting hydrogen fuel en route via electromagnetic scoop.",
      "long_description": "The Bussard Ramjet, first proposed by physicist Robert W. Bussard in 1960, represents one of the most elegant solutions to the interstellar propulsion problem: rather than carrying fuel, the spacecraft collects it from the interstellar medium as it travels.\n\nAt the heart of the system is an enormous electromagnetic scoop, generated by superconducting magnetic coils that create a collection field thousands of kilometers in diameter. As the craft moves through space, this magnetic funnel ionizes and captures interstellar hydrogen. The collected hydrogen is compressed and fed into an onboard CNO-cycle fusion reactor.\n\nBecause fuel is collected continuously, the spacecraft can theoretically accelerate indefinitely, limited only by the decreasing hydrogen density in intergalactic space.",
      "physics": {
        "principle": "Interstellar hydrogen collection and CNO-cycle fusion",
        "energy_source": "Proton-proton chain / CNO cycle fusion",
        "thrust_mechanism": "Magnetic nozzle exhaust of fusion plasma"
      },
      "references": [
        "Bussard, R. W. (1960). 'Galactic Matter and Interstellar Flight'. Astronautica Acta 6:179-194."
      ]
    },
    {
      "tier": 3,
      "id": "quantized_inertia",
      "name": "McCulloch Quantized Inertia Drive",
      "short_name": "QI Drive",
      "effective_velocity_ly_per_year": 16900,
      "compute_cost": 1e18,
      "unlocked": false,
      "description": "Propellantless drive exploiting asymmetric Unruh radiation at quantum horizons.",
      "long_description": "The McCulloch Quantized Inertia (QI) Drive represents a fundamental departure from reaction-based propulsion. Developed from the theoretical work of Dr. Mike McCulloch at the University of Plymouth, this system exploits a proposed quantum-gravitational effect to generate thrust without expelling propellant.\n\nQuantized Inertia theory proposes that inertia itself arises from the interaction between an accelerating object and Unruh radiation. The QI Drive creates a precisely engineered electromagnetic metamaterial cavity that artificially modifies the local information horizon, creating thrust from the structure of spacetime itself.",
      "physics": {
        "principle": "Asymmetric Unruh radiation via engineered information horizons",
        "energy_source": "Electrical power (converted to cavity field maintenance)",
        "thrust_mechanism": "Zero-point energy density gradient exploitation"
      },
      "references": [
        "McCulloch, M. E. (2013). 'Inertia from an Asymmetric Casimir Effect'. EPL 101:59001."
      ]
    },
    {
      "tier": 4,
      "id": "mach_effect",
      "name": "Woodward Mach Effect Thruster",
      "short_name": "MET Drive",
      "effective_velocity_ly_per_year": 23600,
      "compute_cost": 1e21,
      "unlocked": false,
      "description": "Propellantless propulsion via transient mass fluctuations predicted by Mach's Principle.",
      "long_description": "The Woodward Mach Effect Thruster (MET) exploits transient fluctuations in inertial mass predicted by a relativistic extension of Mach's Principle. Developed primarily by physicist James F. Woodward at California State University, Fullerton, this drive represents a direct manipulation of the gravitational interaction between local and cosmological matter.\n\nThe MET uses stacks of piezoelectric discs driven at ultrasonic frequencies. The highly nonlinear interaction between electrical and mechanical oscillations at resonance creates the conditions for measurable thrust without propellant.",
      "physics": {
        "principle": "Transient mass fluctuations via Mach's Principle",
        "energy_source": "Electrical power (piezoelectric excitation)",
        "thrust_mechanism": "Momentum transfer during mass fluctuation events"
      },
      "references": [
        "Woodward, J. F. (2012). 'Making Starships and Stargates'. Springer-Praxis."
      ]
    },
    {
      "tier": 5,
      "id": "pais_field",
      "name": "Pais Inertial Mass Reduction Field",
      "short_name": "Pais Field",
      "effective_velocity_ly_per_year": 32900,
      "compute_cost": 1e24,
      "unlocked": false,
      "description": "High-frequency electromagnetic field generator that reduces local inertial mass.",
      "long_description": "The Pais Inertial Mass Reduction Field represents a paradigm shift in propulsion technology, moving beyond thrust generation to direct manipulation of inertial properties. Based on patents filed by Dr. Salvatore Cezar Pais on behalf of the U.S. Naval Air Systems Command (NAVAIR).\n\nThe field generator consists of a toroidal plasma containment system surrounded by counter-rotating relativistic electron beams. When activated, the spacecraft's effective mass decreases dramatically, reducing the energy required for acceleration by orders of magnitude.",
      "physics": {
        "principle": "Higgs field interaction modification via vacuum polarization",
        "energy_source": "Compact fusion reactor driving electron beam accelerators",
        "thrust_mechanism": "Conventional thrust with reduced inertial resistance"
      },
      "references": [
        "Pais, S. C. (2018). 'Craft Using an Inertial Mass Reduction Device'. U.S. Patent 10,144,532."
      ]
    },
    {
      "tier": 6,
      "id": "flux_liner",
      "name": "Lockheed Flux Liner",
      "short_name": "Flux Liner",
      "effective_velocity_ly_per_year": 45900,
      "compute_cost": 1e27,
      "unlocked": false,
      "description": "Gravitoelectromagnetic field propulsion with complete inertial decoupling.",
      "long_description": "The Lockheed Flux Liner represents the culmination of decades of classified research into gravitoelectromagnetic coupling and spacetime metric engineering. The name derives from the distinctive magnetic flux patterns generated by its propulsion system.\n\nThe Flux Liner exploits the coupling between high-intensity rotating electromagnetic fields and the gravitoelectromagnetic field equations. By generating powerful rotating magnetic fields using mercury-based plasma vortices, the drive creates a localized distortion of spacetime that effectively decouples the craft from external gravitational and inertial reference frames.",
      "physics": {
        "principle": "Gravitoelectromagnetic field coupling via rotating plasma",
        "energy_source": "Zero-point energy extraction from rotating plasma vortex",
        "thrust_mechanism": "Asymmetric metric tensor manipulation"
      },
      "references": [
        "McCandlish, M. (2001). 'Zero Point Energy and the Flux Liner ARV'. Disclosure Project Testimony."
      ]
    },
    {
      "tier": 7,
      "id": "alcubierre_warp",
      "name": "Alcubierre Warp Drive",
      "short_name": "Warp Drive",
      "effective_velocity_ly_per_year": 64000,
      "compute_cost": 1e30,
      "unlocked": false,
      "description": "Spacetime metric manipulation creating a warp bubble that contracts space ahead and expands it behind.",
      "long_description": "The Alcubierre Warp Drive, first theorized by Mexican physicist Miguel Alcubierre in 1994, represents humanity's first practical implementation of faster-than-light travel. Rather than accelerating through space, the warp drive contracts spacetime ahead of the spacecraft and expands it behind, creating a 'warp bubble' that moves through space while the craft inside remains stationary relative to its local metric.\n\nWithin the warp bubble, the spacecraft experiences flat spacetime—no acceleration forces, no time dilation.",
      "physics": {
        "principle": "York time manipulation via Alcubierre metric solution to Einstein field equations",
        "energy_source": "Mass-energy conversion of stored exotic matter",
        "thrust_mechanism": "Spacetime geometry modification (space moves around the craft)"
      },
      "references": [
        "Alcubierre, M. (1994). 'The Warp Drive: Hyper-fast Travel Within General Relativity'. Classical and Quantum Gravity 11:L73."
      ]
    },
    {
      "tier": 8,
      "id": "martire_warp",
      "name": "Gianni-Martire Positive Energy Warp",
      "short_name": "Applied Warp",
      "effective_velocity_ly_per_year": 89000,
      "compute_cost": 1e33,
      "unlocked": false,
      "description": "Second-generation warp technology using positive energy configurations.",
      "long_description": "The Gianni-Martire Positive Energy Warp Drive represents the second generation of metric engineering propulsion, eliminating the exotic matter requirements that plagued the original Alcubierre design. Developed by the Applied Physics research group under CEO Gianni A. Martire.\n\nThe key insight was recognizing that certain 'soliton' solutions to Einstein's field equations could create warp bubbles using only positive-energy matter configurations. These 'physical warp drives' require no negative energy, no exotic matter, and no violations of known physics.",
      "physics": {
        "principle": "Positive-energy soliton solution to Einstein field equations",
        "energy_source": "Total mass-energy conversion via kugelblitz",
        "thrust_mechanism": "Self-propagating spacetime soliton wave"
      },
      "references": [
        "Bobrick, A. & Martire, G. (2021). 'Introducing Physical Warp Drives'. Classical and Quantum Gravity 38:105009."
      ]
    },
    {
      "tier": 9,
      "id": "krasnikov_tube",
      "name": "Krasnikov Tube Network",
      "short_name": "K-Tube",
      "effective_velocity_ly_per_year": 124000,
      "compute_cost": 1e36,
      "unlocked": false,
      "description": "Permanent superluminal transit corridors through modified spacetime.",
      "long_description": "The Krasnikov Tube Network represents a fundamental shift from vehicle-based propulsion to infrastructure-based transit. First theorized by Russian physicist Serguei Krasnikov in 1995, these 'tubes' are permanent modifications to the spacetime metric that allow superluminal travel along pre-established routes.\n\nUnlike warp drives, which carry their spacetime distortion with them, a Krasnikov Tube is a fixed structure—a corridor of modified spacetime connecting two points. A mature Krasnikov network resembles a cosmic railroad system.",
      "physics": {
        "principle": "Permanent spacetime metric modification via vacuum energy manipulation",
        "energy_source": "Zero-point energy extraction along tube length",
        "thrust_mechanism": "N/A (passive infrastructure)"
      },
      "references": [
        "Krasnikov, S. (1995). 'Hyperfast Interstellar Travel in General Relativity'. Physical Review D 57:4760."
      ]
    },
    {
      "tier": 10,
      "id": "planck_drive",
      "name": "Planck-Scale Tunneling Drive",
      "short_name": "Planck Drive",
      "effective_velocity_ly_per_year": 173000,
      "compute_cost": 1e39,
      "unlocked": false,
      "description": "Near-instantaneous transit via macroscopic quantum tunneling through Planck-scale wormholes.",
      "long_description": "The Planck-Scale Tunneling Drive represents the theoretical endpoint of propulsion technology. Rather than traversing the intervening distance, this drive exploits the quantum foam structure of spacetime itself to tunnel directly from origin to destination.\n\nAt the Planck scale (10⁻³⁵ meters), spacetime loses its smooth classical character and becomes a seething quantum foam of virtual wormholes. The Planck Drive stabilizes and enlarges these quantum wormholes for macroscopic transit.",
      "physics": {
        "principle": "Macroscopic quantum tunneling through stabilized Planck-scale wormholes",
        "energy_source": "Vacuum energy extraction at destination",
        "thrust_mechanism": "N/A (no motion through space occurs)"
      },
      "references": [
        "Wheeler, J. A. (1957). 'On the Nature of Quantum Geometrodynamics'. Annals of Physics 2:604.",
        "Visser, M. (1995). 'Lorentzian Wormholes: From Einstein to Hawking'. AIP Press."
      ]
    }
  ]
}
